
#include "Result.h"
#include "TbDictionary.h"
#include "DictionaryService.h"
#include <vector>
using namespace  std;
#pragma once
class CollectionPlanController
{

private:
	DictionaryService m_collectionPlanService;

public:
	CollectionPlanController();
	~CollectionPlanController();

	/**********************************************************************
	功能描述：查询所有的采集计划
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result FindAllBySearchCondition(vector<TbDictionary> & dictionaryVec, int dictId = 0, CString dictName = "", CString dictValue = "");
	/**********************************************************************
	功能描述： 删除采集计划
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result DeleteById(TbDictionary dictionary);
	/**********************************************************************
	功能描述：更新采集计划
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result Update(TbDictionary dictionary);
	/**********************************************************************
	功能描述： 添加采集计划
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result Add(TbDictionary dictionary);

};

