
#pragma once
#include "Result.h"
#include "TbDictionary.h"
#include "DictionaryService.h"
#include <vector>
using namespace  std;
class DictionaryController
{

private:
	DictionaryService m_dictionaryService;
public:
	DictionaryController();
	~DictionaryController();

	/**********************************************************************
	功能描述：查找指定字典名的所有字典对象
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result FindAllBySearchCondition(vector<TbDictionary> & dictionaryVec,int dictId = 0,CString dictName = "",CString dictValue ="");
	/**********************************************************************
	功能描述：根据id查找对应的字典表数据
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result FindById(TbDictionary & dictionaryVec, int dictId);
	/**********************************************************************
	 功能描述： 删除字典
	 输入参数：
	 输出参数： 
	 返 回 值： 
	 其它说明：
	 修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result DeleteById(TbDictionary dictionary);
	/**********************************************************************
	 功能描述：更新字典
	 输入参数：
	 输出参数： 
	 返 回 值： 
	 其它说明：
	 修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result UpdateDictionary(TbDictionary dictionary);
	/**********************************************************************
	 功能描述： 添加字典
	 输入参数：
	 输出参数： 
	 返 回 值： 
	 其它说明：
	 修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
	Result AddDictionary(TbDictionary dictionary);



};

