/************************************************************************
文件名称： CSelfCheckController.h
内容摘要： 信号特征提取业务逻辑.主要实现信号特征提取，对应的实现类文件为CSelfCheckController.cpp。

************************************************************************/
#pragma once
class CFeatureExtrationController
{
public:
	CFeatureExtrationController();
	~CFeatureExtrationController();

	/**********************************************************************
	功能描述 信号特征提取
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/

	/**********************************************************************
	功能描述 信号数据库存储
	输入参数：
	输出参数：
	返 回 值：
	其它说明：
	修改日期 版本号 修改人 修改内容
	----------------------------------------------------------------------
	***********************************************************************/
};

